{"inventory":{
    "jobID":"4c65de0a6659bfe7",
    "posted":"2023-01-12T21:15:31.508Z",
    "searchOrigin":"https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BIC_5kcTbvtVm0sIRMvbKnENZ774lmUhEY4ff4HxBjcumrCZEmDUQQhZbDsF-vw-tTvxedtiHmy8VLvAA77O8RycVu74oxXd30ubs9nv7BlqcIygTBixA4cnwK1tXcUDtMoCSQl9eM1FKNdem3nxdFGXcmr-DwA26FFMezOGdhx0XRsua_Q0pzpvHMUPu5QdMsHUvSKdHuMEplmeBfSM80RpBgtv4jk-zSNsyW4CAz8ca-exJ868QKjJmptUsnD11dckaZShXH0TYdGd85nUyRDglMc_UKXnLvJqyBN-NiJTwyS2DEr__QfFN7rrEEUV6KMqNJ0rsZbWFY4_I0LZrPXxchLjdLODJKczfHUoIXLtko81CKFRx9U269-wgrrsPSE2zrpGT-eL5v8xwVD6_5tXlpQGMY4wz6Q5jQ-O0g5cc_ToQmZ2-d3fi-y2j-3lhCQqOjPkoMx8kTH9bNG_Uo3lIsjXBBavUBXwiwJBt9ApDfr7VwSxWjpAPViCMGXxDaiIyDnh4aPrxwxEekVDGl&xkcb=SoDW-_M3UTy8xbgn9D0LbzkdCdPP&p=0&fvj=1&vjs=3"},
    "origin_title":"Embedded Software Engineer III",
    "job_info":{
        "companyName":"Applied Medical",
        "locations":[{"street":null,"city":"Rancho Santa Margarita","state":"CA","zip":"92688","country":"United States"}]},
        "remote":null,
        "visa":null,
        "citizenship":null,
        "clearence":null,
        "education_req":{
            "degree":null,
            "major":null},
        "skills":[],
        "job_type":["full-time"],
        "compensation":{
            "salary":{
                "min":80000,
                "max":125000,
                "interval":"year"},
            "benefits":{
                "other":["Tuition reimbursement"],
                "_401K":1,
                "_401K_matching":1,
                "PTO":0,
                "insurance":{"health":1,"dental":1,"vision":1,"life":0}}},
        "job_description":"<p>Applied Medical is a new generation medical device company with a proven business model and commitment to innovation fueled by rapid business growth and expansion. Our company has been developing and manufacturing advanced surgical technologies for over 35 years and has earned a strong reputation for excellence in the healthcare field. Our unique business model, combined with our dedication to delivering the highest quality products, enables team members to contribute in a larger capacity than is possible in typical positions.</p>\n<p>Position Description: As an Embedded Software Engineer III, you will learn and develop skills related to medical device development as part of a cross-functional team:</p>\n<ul>\n <li>Develop, maintain, and improve the software design and implementation of new and existing devices</li>\n <li>Develop software of embedded devices and systems across the software development life cycle</li>\n <li>Designing, developing, coding, testing, and debugging system software</li>\n <li>Develop and update engineering documents across the software development life cycle</li>\n <li>Perform other tasks and responsibilities, as required</li>\n</ul>\n<p>Position Requirements: This position requires the following skills and attributes:</p>\n<ul>\n <li>Bachelor’s degree in Computer Engineering, Computer Science, or Electrical Engineering</li>\n <li>More than 2 years’ experience in similar or related field</li>\n <li>Proficient in understanding, analyzing, and troubleshooting embedded systems</li>\n <li>Proficiency in programming languages, such as C and C++</li>\n <li>Works well within a software Version Control System</li>\n <li>Effective at working in cross-functional teams</li>\n <li>Effective oral and written communication skills</li>\n <li>Technical aptitude and detail-oriented</li>\n</ul>\n<p>Preferred: The following skills and attributes are preferred:</p>\n<ul>\n <li>Experience developing software for a real-time operating system in a regulated industry</li>\n <li>Proficient in Board Bring-Up integrations</li>\n <li>Experience developing software to control serial and parallel interfaces, including USB, SPI, and I2C</li>\n <li>Familiarity with software development in Windows and Unix development systems</li>\n <li>Familiarity with the medical device design process</li>\n <li>Working knowledge of manufacturing and quality standards, including FDA regulations and International Organization for Standardization (ISO) quality system</li>\n</ul>\n<p>Benefits: The base compensation range for this role is $80,000 - $125,000 / year for the position in California. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. The range displayed reflects the minimum and maximum target for new hire salaries in California based on the date of this job posting. Your recruiter can share more about the specific salary range compensation package during your hiring process.<br>Please understand that the compensation range may be modified in the future. Each amount of pay is considered to be wages or compensation once such amount is earned and determinable. The amount and availability of any bonus, commission, benefit or any other form of compensation may be modified at the Company’s sole discretion, consistent with the law.<br>The total compensation package for this position may also include [bonuses and/or other applicable incentive compensation plans].<br>Our total reward package also includes the following:</p>\n<ul>\n <li>Training and mentorship with ongoing learning and development courses</li>\n <li>On-campus wellness activities</li>\n <li>Comprehensive medical and dental and vision coverage</li>\n <li>Education reimbursement program</li>\n <li>401(k) program with discretionary employer match</li>\n <li>Generous vacation accrual and paid holiday schedule</li>\n</ul>\n<p>All compensation and benefits are subject to the requirements and restrictions set forth in the applicable plan documents and any written agreements between the parties.<br>Equal Opportunity Employer<br>Applied Medical is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (including pregnancy, childbirth, breastfeeding and related medical conditions), or sexual orientation, or any other status protected by federal, state or local laws in the locations where Applied Medical operates.<br>Location: 22872 Avenida Empresa, Rancho Santa Margarita, CA 92688</p>\n<p>Location: 22872 Avenida Empresa, Rancho Santa Margarita, CA 92688</p>\n<p>Job Type: Full-time</p>\n<p>Pay: $80,000.00 - $125,000.00 per year</p>"}